Trying 127.0.0.1...
Connected to 127.0.0.1.
Escape character is '^]'.
Connected to Dynamips VM "R4" (ID 5, type c3600) - Console port

enable
% Please answer 'yes' or 'no'.
Would you like to enter the initial configuration dialog? [yes/no]: no


Press RETURN to get started!


*Mar  1 00:00:02.539: %LINEPROTO-5-UPDOWN: Line protocol on Interface VoIP-Null0, changed state to up
*Mar  1 00:00:05.539: %LINK-3-UPDOWN: Interface FastEthernet0/0, changed state to up
*Mar  1 00:00:08.539: %LINK-3-UPDOWN: Interface FastEthernet1/0, changed state to up
*Mar  1 00:00:09.215: %SYS-5-RESTART: System restarted --
Cisco IOS Software, 3600 Software (C3640-IS-M), Version 12.3(14)T7, RELEASE SOFTWARE (fc2)
Technical Support: http://www.cisco.com/techsupport
Copyright (c) 1986-2006 by Cisco Systems, Inc.
Compiled Wed 22-Mar-06 21:46 by pwade
*Mar  1 00:00:09.219: %SNMP-5-COLDSTART: SNMP agent on host Router is undergoing a cold start
*Mar  1 00:00:11.539: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0, changed state to down
*Mar  1 00:00:11.539: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet1/0, changed state to down
*Mar  1 00:00:11.539: %LINK-5-CHANGED: Interface FastEthernet0/0, changed state to administratively down
*Mar  1 00
Router>:00:11.539: %LINK-5-CHANGED: Interface FastEthernet1/0, changed state to administratively down
Router>
Router>
Router>
Router>
Router>
Router>
Router>
Router>enable
Router#show ?
  aaa                       Show AAA values
  aal2                      Show commands for AAL2
  access-expression         List access expression
  access-lists              List access lists
  accounting                Accounting data for active sessions
  adjacency                 Adjacent nodes
  alarm-interface           Display information about a specific Alarm
                            Interface Card
  aliases                   Display alias commands
  alignment                 Show alignment information
  alps                      Alps information
  archive                   Archive of the running configuration information
  arp                       ARP table
  async                     Information on terminal lines used as router
                            interfaces
  auto                      Show Automation Template
  backhaul-session-manager  Backhaul Session Manager information
  backup                    Backup status
  bcm560x                   BCM560x HW Table
  bgp                       BGP information
  bridge                    Bridge Forwarding/Filtering Database [verbose]
  bsc                       BSC interface information
  bstun                     BSTUN interface information
  buffers                   Buffer pool statistics
          
Router#show 
% Type "show ?" for a list of subcommands
Router#config term
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#int f1/0
Router(config-if)#ip address 192.168.1.2 255.255.255.0
Router(config-if)#no shutdown
Router(config-if)#w
*Mar  1 00:04:30.679: %LINK-3-UPDOWN: Interface FastEthernet1/0, changed state to up
*Mar  1 00:04:31.679: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet1/0, changed state to u     
Router(config-if)#write
                  ^
% Invalid input detected at '^' marker.

Router(config-if)#
Router#write
*Mar  1 00:04:41.915: %SYS-5-CONFIG_I: Configured from console by console
Building configuration...
[OK]
Router#

